--
-- Host: 127.0.0.1    Database: litemall
-- ------------------------------------------------------
-- Server version	5.7.21-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;




use HelpEaseProApp;

CREATE TABLE `t_article`
(
    `id`            varchar(50) NOT NULL,
    `uid`           varchar(50) NOT NULL COMMENT '用户ID',
    `title`         varchar(50) NOT NULL COMMENT '求助标题',
    `has_poster`    tinyint     NOT NULL COMMENT '海报',
    `type`          varchar(50) NOT NULL COMMENT '标签',
    `poster`        varchar(50) DEFAULT NULL COMMENT '图片',
    `content`       text        NOT NULL COMMENT '正文',
    `agree_count`   int         NOT NULL COMMENT '点赞',
    `create_at`     varchar(50) NOT NULL COMMENT '时间',
    `comment_count` int         NOT NULL COMMENT '评论',
    PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE `t_comment`
(
    `id`        varchar(50) NOT NULL,
    `uid`       varchar(50) NOT NULL COMMENT '用户ID',
    `aid`       varchar(50) NOT NULL COMMENT '文章ID',
    `content`   text        NOT NULL COMMENT '评论内容',
    `create_at` varchar(50) NOT NULL COMMENT '时间',
    PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE `t_image`
(
    `id`   varchar(50) NOT NULL,
    `data` longblob    NOT NULL COMMENT '图片（二进制）',
    PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE `t_user`
(
    `id`        varchar(50) NOT NULL,
    `nickname`  varchar(20) NOT NULL COMMENT '昵称',
    `phone`     varchar(11) NOT NULL COMMENT '电话',
    `password`  varchar(20) NOT NULL COMMENT '密码',
    `avatar`    varchar(50) NOT NULL COMMENT '头像',
    `school`    varchar(50) NOT NULL COMMENT '学校',
    `create_at` varchar(50) NOT NULL COMMENT '时间',
    PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

CREATE TABLE `t_video`
(
    `id`        varchar(50) NOT NULL,
    `uid`       varchar(50) NOT NULL COMMENT '用户ID',
    `fid`       varchar(50) NOT NULL COMMENT 'id',
    `type`      varchar(20) NOT NULL COMMENT '标签',
    `title`     varchar(50) NOT NULL COMMENT '标题',
    `create_at` varchar(50) NOT NULL COMMENT '时间',
    PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;








INSERT INTO `t_article` VALUES (1,6,'寻求志愿者帮助清理社区公园',1,'社区','11','公园垃圾清扫，落叶清理',145,'2023-04-09 21:06:11',1),
(2,2,'需要一名保姆',2,'生活','11','寻找一位有经验的保姆，负责照顾孩子的起居、饮食和教育',95,'2023-04-09 21:06:11',3),
(3,6,'需要有人给自己推荐素食餐谱',3,'社区','11','对素食有兴趣，希望能够了解一些素食餐谱和健康的素食',25,'2023-04-09 21:06:11',0),
(4,7,'想了解驾驶证扣分的处理方式',4,'出行','11','在交通事故中被处罚扣分，不知道如何处理，希望了解驾驶证扣分的处理方式和补救措施',45,'2023-04-10 21:06:11',4),
(5,8,'大学专业选择困难',5,'学习','11','大学生在选择专业时遇到了困难，不知道如何确定自己的兴趣和职业规划，希望得到相关的帮助和建议',25,'2023-04-10 21:06:11',0),
(6,12,'求推荐好玩的单机游戏',6,'娱乐','11','我想玩一些好玩的单机游戏，希望能够得到大家的推荐',35,'2023-04-10 21:06:11',0),
(7,4,'被恋人背叛，需要情感抚慰和建议',7,'情感','11','我最近面临人生的一个重要决策，不知道该如何选择，需要有人能够帮助我思路清晰，给予一些建议和指导',55,'2023-04-11 21:06:11',14),
(8,7,'感到心情低落，需要情感支持',8,'情感','11','最近心情一直不太好，感到很沮丧，需要有人能够给我一些情感支持和鼓励，帮助我渡过难关',75,'2023-04-11 21:06:11',5),
(9,5,'急需团队帮助抢修电器',9,'生活','11','昨晚用电器烧坏了，需要专业人士帮助',25,'2023-04-11 21:06:11',0),
(10,4,'太过孤独，急需找一个女朋友',10,'校园','11','想找一个女朋友和自己一起旅游',65,'2023-04-12 21:06:11',6),
(11,9,'我的团队面临一个绩效问题',11,'商务','11','如何设计一套公平、有效的绩效考核体系',5,'2023-04-12 21:06:11',0),
(12,12,'寻找情感交流对象',12,'情感','11','最近感到孤独和无助，想找一位情感交流对象，共同分享内心的想法和感受',85,'2023-04-12 21:06:11',0),
(13,7,'寻找阅读伴侣',13,'情感','11','我喜欢阅读，但没有人和我分享读书的乐趣。我希望能够找到一位阅读伴侣，和我一起讨论和分享书籍',43,'2023-04-12 21:06:11',5),
(14,12,'帮我购买火车高铁票',14,'出行','11','我需要购买火车高铁票，但是不知道如何购买，希望有人能够提供一些购票建议和方法',56,'2023-04-13 21:06:11',0),
(15,14,'新城市交友',15,'社区','11','我最近搬到一个新城市，想认识一些志同道合的朋友',52,'2023-04-13 21:06:11',0),
(16,2,'对于租房市场不是很了解',16,'生活','11','刚来到新的城市，对于租房市场不是很了解，希望能得到一些租房方面的建议和推荐',33,'2023-04-13 21:06:11',5),
(17,4,'帮我找回丢失的宠物猫',17,'生活','11','它叫九猫爷，黄色胖嘟嘟，它喜欢吃豆腐',35,'2023-04-13 21:06:11',3),
(18,2,'帮我规划旅行',18,'社区','11','我想去旅游，但是不知道如何规划路线和时间，希望有人能够提供一些规划和安排的建议...',68,'2023-04-13 21:06:11',5),
(19,8,'请推荐几个好听的歌曲',19,'娱乐','11','我想听一些有深度的歌曲，有没有什么推荐',39,'2023-04-14 21:06:11',0),
(20,10,'我想参加一些有意义的志愿活动',20,'校园','11','我想参加一些有意义的志愿活动，帮助他人，提升自己的社会责任感和领导能力，有哪些推荐',66,'2023-04-14 21:06:11',0),
(21,3,'需要设计师的帮助',21,'商务','11','我正在开发一个新的产品，并需要一个专业的设计师来为我们设计产品外观和包装',83,'2023-04-14 21:06:11',7),
(22,11,'求助家庭教育',22,'生活','11','我是一名父母，但是我不太熟悉如何进行好的家庭教育',51,'2023-04-14 21:06:11',3),
(23,13,'我想入门电竞游戏',23,'娱乐','11','我想入门电竞游戏，请大家帮我推荐一些好的游戏',5,'2023-04-15 21:06:11',0);



INSERT INTO `t_comment` VALUES (1,4,1,'我一定会去打扫，但是我是不会收钱的','2023-04-09 21:06:11'),
(2,5,2,'你好，我是一名有着丰富保姆经验的专业人士。我非常喜欢照顾孩子，对于孩子们的起居、饮食和教育都有着深刻的理解和认识。如果你需要一位照顾孩子的保姆，我愿意为你提供帮助。','2023-04-09 08:06:11'),
(3,7,2,'作为一名有着多年保姆经验的人，我知道如何为孩子们提供最好的照顾。我善于与孩子们建立良好的关系，了解他们的需求和兴趣，并为他们提供有针对性的教育和引导。如果你需要一位专业的保姆，我可以为你提供帮助','2023-04-09 09:06:11'),
(4,3,2,'如果您想要找到一位有经验的保姆，可以在招聘信息中明确要求候选人具有相关工作经验，并在面试中重点关注候选人的经验和技能','2023-04-09 21:06:11'),

(5,2,4,'我之前也遇到过这种情况，建议你先去交管部门了解一下具体情况，然后再根据情况制定对应的补救措施，可能需要学习一些交通规则知识，这样才能更好地避免类似情况再次发生','2023-04-09 11:06:11'),
(6,3,4,'如果你没有经验，可以找一些专业的驾驶证代办服务机构，他们会提供一些解决方案和服务，包括查询交通违法记录、处理罚款和扣分等','2023-04-09 12:06:11'),
(7,14,4,'扣分是一件非常麻烦的事情，因此我建议你认真对待，尽可能多了解一些相关的法律和规定，找到最佳的处理方式，以便你尽快恢复你的驾驶资格','2023-04-15 21:06:11'),
(8,4,4,'驾驶证扣分是很常见的事情，建议你不要慌张，及时与交管部门联系，查明自己的违法情况，然后根据情况及时处理，不要拖延时间','2023-04-15 01:06:11'),

(9,2,7,'很抱歉听到你的困境。首先，你需要冷静下来，不要过于冲动或者做出任何决定。想一想自己真正想要的是什么，然后和恋人坦诚地谈谈。','2023-04-15 11:06:11'),
(10,3,7,'不要轻易放弃，也不要失去信心。在这个困境中，保持积极的心态是最重要的。相信自己，相信未来会更好。','2023-04-15 12:06:11'),
(11,1,7,'我曾经也经历过类似的事情，我建议你找一个好朋友聊聊，或者去看一下心理医生。他们可以给你一些建议和指导。','2023-04-15 13:06:11'),
(12,5,7,'你可以尝试去做一些你一直想做但一直没有时间去做的事情，比如学习新的技能或者旅行。这可以让你摆脱一些负面情绪。','2023-04-15 14:06:11'),
(13,6,7,'如果你需要一些具体的建议，那么请考虑寻找专业的情感咨询师。他们可以帮助你理清思路，从而做出明智的决定。','2023-04-15 15:06:11'),
(14,7,7,'你需要找到一种方式来处理你的情绪，比如写日记、打卡拉OK、运动等等。这可以帮助你释放情绪。','2023-04-15 16:06:11'),
(15,8,7,'面对任何困境都要勇敢地面对，你可以从这个经历中学到很多东西。不要让这个经历浪费你的生命。','2023-04-15 17:06:11'),
(16,2,7,'试着接受自己的感受，不要压抑自己的情绪。只有当你真正面对自己的感受时，才能走出困境。','2023-04-15 18:06:11'),
(17,9,7,'你可以找一些心理健康小组或社群，和有经验的人交流一下。他们可能会给你一些启示或建议。','2023-04-15 19:06:11'),
(18,10,7,'如果你认为需要，你可以寻求法律帮助。但请记住，和恋人和平分手可能是更好的选择。','2023-04-15 20:06:11'),
(19,11,7,'不要想着复仇或者报复，这只会让你更加痛苦。相反，尝试去原谅他们并让自己走出这个阴影。','2023-04-15 21:06:11'),
(20,12,7,'爱情需要双方努力维护，不要将责任全部推到对方身上。尝试找出你们之间的问题，并想办法解决它们。','2023-04-15 22:06:11'),
(21,13,7,'尽管现在的困境可能很难过，但请相信自己，你一定可以度过难关。','2023-04-15 22:06:11'),
(22,14,7,'坚持一些积极的习惯，比如每天写日记、锻炼身体、读书等等。','2023-04-15 23:06:11'),

(23,3,8,'加油！你不是一个人在战斗，我们会一起陪你走过这段时间的困难，一起努力变得更好。','2023-04-15 08:06:11'),
(24,4,8,'没事的，一切都会好起来的。别放弃，向前看，积极面对生活中的挑战。','2023-04-15 09:06:11'),
(25,2,8,'无论遇到什么事情，都不要自责或者放弃，你是一个坚强的人，你可以战胜一切。','2023-04-15 10:06:11'),
(26,6,8,'没有什么比坚定的信念和不屈的意志更重要了，希望你可以找到自己坚持下去的动力。','2023-04-15 11:06:11'),
(27,9,8,'不要害怕向身边的人寻求帮助，我们会一起渡过难关的，也许一些轻松愉快的活动也会帮助你缓解情绪。','2023-04-15 12:06:11'),

(28,13,10,'你要哪一款，只要你有钱，我这里应有尽有，你说，你掏钱，剩下的交给我','2023-04-15 21:06:11'),
(29,3,10,'两情若是久长时，又岂在朝朝暮暮，。！','2023-04-15 22:06:11'),
(30,2,10,'宁缺毋滥，三思而后行','2023-04-15 23:06:11'),
(31,8,10,'帅气的小哥哥，你看我怎么样，可以和你一起去旅行吗','2023-04-15 24:06:11'),
(32,11,10,'佳明，不要乱啊，收敛收敛','2023-04-15 25:06:11'),
(33,12,10,'哈哈，来新疆吐鲁番盆地，这里的新疆美女应有尽有','2023-04-15 26:06:11'),

(34,3,13,'我很愿意成为你的阅读伴侣，与你一起分享读书的乐趣。我们可以交流自己喜欢的书籍和阅读体验。','2023-04-15 11:06:11'),
(35,4,13,'我和你一样也非常喜欢阅读，希望我们可以一起成为阅读伴侣，分享和探讨我们所看到的书籍','2023-04-15 12:06:11'),
(36,6,13,'很高兴看到你发出这样的帖子，我也一直在寻找一个阅读伴侣。我们可以一起读书、分享感受、交流看法。','2023-04-15 13:06:11'),
(37,10,13,'非常欣赏你寻找阅读伴侣的勇气，我也非常喜欢阅读，如果你愿意，我们可以一起分享我们的书籍，分享读书的乐趣。','2023-04-15 14:06:11'),
(38,2,13,'作为一个喜欢阅读的人，我理解你寻找阅读伴侣的心情。如果你愿意，我们可以一起分享和探讨书籍。','2023-04-15 15:06:11'),

(39,3,16,'可以去当地的租房中介了解一下，看看有没有适合你的房源，他们会给你一些专业的建议和帮助。','2023-04-15 05:06:11'),
(40,5,16,'可以去网上搜索一些租房平台，例如安居客、链家等，这些平台有许多出租房源，可以方便快捷地找到自己心仪的房子。','2023-04-15 06:06:11'),
(41,7,16,'去当地的租房群或论坛发帖求助，向当地居民或者租房经验丰富的人寻求建议和推荐，他们的经验可能对你很有帮助。','2023-04-15 07:06:11'),
(42,9,16,'在租房过程中，一定要注意房东的信誉度和房子的实际情况，避免遇到骗子或者住进不安全的房子。','2023-04-15 21:06:11'),
(43,1,16,'租房的地点、价格、安全性等方面都要考虑周全，可以先在网上或者社交媒体上了解一下当地租房市场的情况，再做决定。','2023-04-15 08:06:11'),

(44,9,17,'建议你在周围的社区、宠物店、动物医院等地方张贴寻找失踪宠物的海报，这样可以扩大你的搜索范围。','2023-04-15 21:06:11'),
(45,3,17,'不要放弃希望，继续寻找，相信九猫爷很快就会回到你身边。','2023-04-15 22:06:11'),
(46,2,17,'试着在失踪的地点附近寻找，通常宠物会在离开的地方附近徘徊，希望能够找到线索。','2023-04-15 23:06:11'),

(47,3,18,'如果你喜欢探险，可以规划一些国家公园或者森林公园，比如黄石国家公园、大峡谷国家公园等，非常适合户外运动和探险活动。','2023-04-15 11:06:11'),
(48,10,18,'如果你喜欢文化和历史，可以选择一些博物馆或者历史古迹进行游览，比如大英博物馆、埃菲尔铁塔、故宫博物院等，非常有意思。','2023-04-15 12:06:11'),
(49,8,18,'如果你喜欢美食和购物，可以选择一些有名的旅游城市，比如巴黎、东京、纽约等，可以品尝当地特色美食和购买当地特产。','2023-04-15 13:06:11'),
(50,6,18,'如果你想放松身心，可以选择一些温泉度假村或者海滨度假胜地，比如巴厘岛、马尔代夫、夏威夷等，享受放松的假期。','2023-04-15 14:06:11'),
(51,7,18,'不要忘了在旅途中放松自己，找一些适合自己的休闲娱乐活动，比如spa、瑜伽等等。','2023-04-15 21:06:11'),

(52,7,21,'您可以在社交媒体平台上寻找相关设计社区或设计师协会，或者在招聘网站上发布职位招聘信息。','2023-04-15 07:06:11'),
(53,4,21,'您可以在一些创意市场上搜索，例如Dribbble、Behance、DesignCrowd等，这些平台汇聚了众多优秀的设计师。','2023-04-15 08:06:11'),
(54,2,21,'在向设计师咨询时，您可以详细描述您的产品定位和目标市场，并提供相关的市场调研数据，以便设计师更好地理解您的需求。','2023-04-15 09:06:11'),
(55,1,21,'如果您已经有一些初步的设计方案，可以与设计师分享，以便他们能够更好地了解您的需求和要求。','2023-04-15 10:06:11'),
(56,5,21,'在雇用设计师之前，可以要求他们提供以往的设计案例和客户反馈，以帮助您更好地了解他们的设计风格和能力。','2023-04-15 11:06:11'),
(57,8,21,'考虑与多个设计师合作，以比较不同设计方案的优缺点，然后选择最符合您需求的设计师。','2023-04-15 12:06:11'),
(58,12,21,'在与设计师合作之前，您需要明确设计费用和时间表，并与设计师签订相关的合同，以确保双方的权益得到保障。','2023-04-15 21:06:11'),

(59,2,22,'建议您阅读一些有关家庭教育的书籍和资料，以获取更多的理论知识和方法技巧。','2023-04-15 17:06:11'),
(60,3,22,'可以寻找一些专业的家庭教育机构或咨询师，参加一些相关的课程或咨询服务，获取更为深入和具体的指导和建议。','2023-04-15 19:06:11'),
(61,4,22,'注意家庭教育的方法和态度，要积极引导孩子，注重沟通和理解，尊重孩子的个性和特点，避免过度干预或过于强制。','2023-04-15 21:06:11');



INSERT INTO `t_image` VALUES (1,LOAD_FILE('C:/Users/Spume--/Pictures/Own/LWGTX.jpg')),
(21,LOAD_FILE('https://i.328888.xyz/2023/03/29/ikzlXc.png'));



INSERT INTO `t_user` VALUES (1,'将军','15987251397','a15987255470','1','深圳大学','2023-04-09 20:24:34'),
(2,'赵雪木玫','15987753801','a15987255470','1','萨马拉国立航空航天大学','2023-04-09 20:24:34'),
(3,'李一','15987255470','a15987255470','1','昆明理工大学','2023-04-09 20:24:34'),
(4,'段三','18988411276','a15987255470','1','昆明理工大学','2023-04-10 20:24:34'),
(5,'段头肉','18388876032','a15987255470','1','滇西科技师范学院','2023-04-11 20:24:34'),
(6,'斗哥','18187439516','a15987255470','1','昆明理工大学','2023-04-12 20:24:34'),
(7,'Regret畅','15510980243','a15987255470','1','昆明理工大学','2023-04-13 20:24:34'),
(8,'彭三','15126609291','a15987255470','1','昆明理工大学','2023-04-13 20:24:34'),
(9,'PP','15687046722','a15987255470','1','昆明理工大学','2023-04-13 20:24:34'),
(10,'包谷','18088243647','a15987255470','1','普洱学院','2023-04-13 20:24:34'),
(11,'小飞飞','18487955612','a15987255470','1','昆明理工大学','2023-04-14 20:24:34'),
(12,'小廷廷','13708438580','a15987255470','1','昆明理工大学','2023-04-14 20:24:34'),
(13,'梁三','15368101963','a15987255470','1','昭通学院','2023-04-15 20:24:34'),
(14,'菜籽','18896222835','a15987255470','1','昆明理工大学','2023-04-15 20:24:34');



INSERT INTO `t_video` VALUES (1,3,'ly.mp4','学习','HelpEasePro开发小计','2023-04-09 11:06:11'),
(2,2,'zxmm.mp4','校园','我们都在努力变好，不是吗','2023-04-09 12:06:11'),
(3,11,'th.mp4','社区','你都如何回忆我','2023-04-09 14:06:11'),
(4,2,'jj.mp4','出行','来也匆匆，去也匆匆，离绪千种','2023-04-09 15:06:11'),
(5,4,'ds.mp4','娱乐','今天出来打桌球了','2023-04-09 16:06:11'),
(6,7,'zc.mp4','情感','那就不见了吧，这次我说真的','2023-04-10 18:06:11'),
(7,6,'qg.mp4','生活','生活可真难啊，哈哈','2023-04-10 21:06:11');
